; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p15-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-0)
    (at p0 l0-0)
    (at p1 l1-0)
    (at p2 l1-1)
    (at p3 l1-1)
    (at p4 l1-0)
    (at p5 l1-1)
    (at p6 l0-0)
    (at p7 l1-1)
    (at p8 l0-1)
    (at p9 l0-1)
    (at p10 l0-1)
    (at p11 l2-2)
    (at p12 l2-1)
    (at p13 l1-1)
    (at p14 l1-1)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l2-2)
        (at p1 l1-1)
        (at p2 l2-1)
        (at p3 l0-1)
        (at p4 l2-1)
        (at p5 l1-1)
        (at p6 l1-0)
        (at p7 l1-2)
        (at p8 l1-2)
        (at p9 l1-1)
        (at p10 l0-2)
        (at p11 l2-0)
        (at p12 l2-2)
        (at p13 l1-1)
        (at p14 l1-1)
    )
)
)

; plan
1. (load-truck p3 t1 l1-1)
   deleted: (at p3 l1-1)
   added: (in p3 t1)
   goals met: 3 of 15
2. (load-truck p7 t1 l1-1)
   deleted: (at p7 l1-1)
   added: (in p7 t1)
   goals met: 3 of 15
3. (load-truck p2 t1 l1-1)
   deleted: (at p2 l1-1)
   added: (in p2 t1)
   goals met: 3 of 15
4. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 3 of 15
5. (load-truck p11 t2 l2-2)
   deleted: (at p11 l2-2)
   added: (in p11 t2)
   goals met: 3 of 15
6. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 3 of 15
7. (load-truck p12 t2 l2-1)
   deleted: (at p12 l2-1)
   added: (in p12 t2)
   goals met: 3 of 15
8. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 3 of 15
9. (unload-truck p12 t2 l2-2)
   deleted: (in p12 t2)
   added: (at p12 l2-2)
   goals met: 4 of 15
10. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 4 of 15
11. (unload-truck p11 t2 l2-0)
   deleted: (in p11 t2)
   added: (at p11 l2-0)
   goals met: 5 of 15
12. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 15
13. (load-truck p9 t0 l0-1)
   deleted: (at p9 l0-1)
   added: (in p9 t0)
   goals met: 5 of 15
14. (load-truck p10 t0 l0-1)
   deleted: (at p10 l0-1)
   added: (in p10 t0)
   goals met: 5 of 15
15. (load-truck p8 t0 l0-1)
   deleted: (at p8 l0-1)
   added: (in p8 t0)
   goals met: 5 of 15
16. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 5 of 15
17. (unload-truck p10 t0 l0-2)
   deleted: (in p10 t0)
   added: (at p10 l0-2)
   goals met: 6 of 15
18. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 6 of 15
19. (unload-truck p9 t0 l0-0)
   deleted: (in p9 t0)
   added: (at p9 l0-0)
   goals met: 6 of 15
20. (unload-truck p8 t0 l0-0)
   deleted: (in p8 t0)
   added: (at p8 l0-0)
   goals met: 6 of 15
21. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 6 of 15
22. (unload-truck p7 t1 l1-2)
   deleted: (in p7 t1)
   added: (at p7 l1-2)
   goals met: 7 of 15
23. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 7 of 15
24. (load-truck p1 t1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t1)
   goals met: 7 of 15
25. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 7 of 15
26. (unload-truck p2 t1 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 7 of 15
27. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 7 of 15
28. (unload-truck p1 t1 l1-1)
   deleted: (in p1 t1)
   added: (at p1 l1-1)
   goals met: 8 of 15
29. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 8 of 15
30. (load-airplane p9 a0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a0)
   goals met: 8 of 15
31. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 8 of 15
32. (load-airplane p8 a0 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 a0)
   goals met: 8 of 15
33. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 8 of 15
34. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 8 of 15
35. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 8 of 15
36. (load-airplane p3 a0 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 8 of 15
37. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 8 of 15
38. (unload-airplane p9 a0 l1-0)
   deleted: (in p9 a0)
   added: (at p9 l1-0)
   goals met: 8 of 15
39. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 9 of 15
40. (unload-airplane p8 a0 l1-0)
   deleted: (in p8 a0)
   added: (at p8 l1-0)
   goals met: 9 of 15
41. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 9 of 15
42. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 9 of 15
43. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 9 of 15
44. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 9 of 15
45. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 10 of 15
46. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 10 of 15
47. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 10 of 15
48. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 10 of 15
49. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 10 of 15
50. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 10 of 15
51. (unload-airplane p2 a0 l2-0)
   deleted: (in p2 a0)
   added: (at p2 l2-0)
   goals met: 10 of 15
52. (load-truck p2 t2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 t2)
   goals met: 10 of 15
53. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 10 of 15
54. (unload-truck p0 t2 l2-2)
   deleted: (in p0 t2)
   added: (at p0 l2-2)
   goals met: 11 of 15
55. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 11 of 15
56. (unload-truck p4 t2 l2-1)
   deleted: (in p4 t2)
   added: (at p4 l2-1)
   goals met: 12 of 15
57. (unload-truck p2 t2 l2-1)
   deleted: (in p2 t2)
   added: (at p2 l2-1)
   goals met: 13 of 15
58. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 13 of 15
59. (load-truck p9 t1 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 t1)
   goals met: 13 of 15
60. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 13 of 15
61. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 13 of 15
62. (unload-truck p8 t1 l1-2)
   deleted: (in p8 t1)
   added: (at p8 l1-2)
   goals met: 14 of 15
63. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 14 of 15
64. (unload-truck p9 t1 l1-1)
   deleted: (in p9 t1)
   added: (at p9 l1-1)
   goals met: 15 of 15
